Repository: cmssoftteam/Kesim
Catalog: Logical/mappView/Visualization/Dialogs/UserX/SystemDialog.tmx
Source language: en
Languages: de, tr

source: username
de: Benutzer
tr: kullanıcı adı

source: old password
de: altes Passwort
tr: eski şifre

source: new password
de: neues Passwort
tr: yeni şifre

source: confirm password
de: Passwort wiederholen
tr: şifreyi onayla

source: change password
de: Passwort ändern
tr: şifreyi değiştir

source: cancel
de: Abbruch
tr: iptal

source: Change password
de: Passwort ändern
tr: Şifre değiştir

source: Password change required for {1}
de: Passwortänderung erforderlich für {1}
tr: {1} için parola değişikliği gerekli

source: Change password for {1}
de: Passwort ändern für {1}
tr: {1} için şifreyi değiştir

source: Password changed successfully!
de: Passwortänderung erfolgreich!
tr: Şifre başarıyla değiştirildi!

source: Password change failed!
de: Passwortänderung fehlgeschlagen!
tr: Şifre değişikliği başarısız!

source: Invalid credentials (username and/or old password).
de: Anmeldedaten (Benutzer und/oder altes Passwort) nicht korrekt.
tr: Geçersiz kimlik bilgileri (kullanıcı adı ve/veya eski şifre).

source: Password does not meet the password policies.
de: Passwort entspricht nicht den Kriterien.
tr: Şifre, şifre politikalarına uymuyor.

source: Password change not possible. Use mpUserX instead of RBAC for authentication.
de: Passwortänderung nicht möglich. Verwenden Sie mpUserX anstatt RBAC zur Authentifizierung.
tr: Şifre değişikliği mümkün değil. Kimlik doğrulaması için RBAC yerine mpUserX kullanın.

source: Timeout.
de: Zeitüberschreitung.
tr: Zaman aşımı.

source: An unknown error has occurred.
de: Ein unbekannter Fehler ist aufgetreten.
tr: Bilinmeyen bir hata oluştu.

source: Username must not be empty.
de: Benutzer darf nicht leer sein.
tr: Kullanıcı adı boş bırakılamaz.

source: Old password must not be empty.
de: Altes Passwort darf nicht leer sein.
tr: Eski şifre boş olamaz.

source: New password must not be empty.
de: Neues Passwort darf nicht leer sein.
tr: Yeni şifre boş bırakılamaz.

source: New password must be different from the old password.
de: Neues Passwort muss sich vom alten Passwort unterscheiden.
tr: Yeni şifreniz eski şifrenizden farklı olmalıdır.

source: Password confirmation does not match the new password.
de: Passwortwiederholung stimmt nicht dem neuen Passwort überein.
tr: Şifre onayı yeni şifreyle uyuşmuyor.

source: Dialog will be closed in {1} seconds.
de: Dialog wird in {1} Sekunden geschlossen.
tr: İletişim kutusu {1} saniye içinde kapatılacak.

source: Your password must have
de: Das Passwort muss enthalten
tr: Şifreniz şu şekilde olmalıdır:

source: Alphanumeric and numeric characters
de: Mindestens einen Buchstaben und eine Zahl
tr: Alfanümerik ve sayısal karakterler

source: Upper- and lowercase characters
de: Groß- und Kleinbuchstaben
tr: Büyük ve küçük harf karakterleri

source: {1} or more characters
de: {1} oder mehr Zeichen
tr: {1} veya daha fazla karakter

source: At least one special character (e.g. $%ö)
de: Mindestens ein Sonderzeichen (z.B. %$ö)
tr: En az bir özel karakter (örn. $%ö)

source: ok
tr: tamam
